Revit 2027 API
LoadClassification Enumeration
 An enumerated type to list all demand factor classifications.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadClassification
Public Enumeration LoadClassification
public enum class LoadClassification
type LoadClassification
Members
Member name | Value | Description
Hvac | 3 |  Load classification is HVAC.
Lighting | 2 |  Load classification is Lighting.
Power | 1 |  Load classification is power.
Undefined | 0 |  Load classification is undefined.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace